# SSD with Mobilenet v2

model {
  ssd {
    inplace_batchnorm_update: true
    freeze_batchnorm: false
    num_classes: 1
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 10.0
        width_scale: 10.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.3
        unmatched_threshold: 0.3
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    encode_background_as_zeros: true
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 4
        #min_scale: 0.05
        #max_scale: 0.6
	      scales: [0.05, 0.1, 0.15, 0.2, 0.3]
        aspect_ratios: 2.26
        aspect_ratios: 1.54
        aspect_ratios: 1.17
        aspect_ratios: 0.94
        aspect_ratios: 0.75
        aspect_ratios: 0.55
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 80
        width: 80
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
        class_prediction_bias_init: -4.6
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.0005
            }
          }
          initializer {
            random_normal_initializer {
              stddev: 0.01
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.97,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_custom1'
      min_depth: 32
      depth_multiplier: 1.0
      conv_hyperparams {
        activation: RELU,
#        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.0005
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.97,
          epsilon: 0.001,
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    loss {
      classification_loss {
        weighted_sigmoid_focal {
          alpha: 0.75,
          gamma: 2.0
        }
      }
      localization_loss {
        weighted_smooth_l1 {
          delta: 1.0
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.5
        iou_threshold: 0.2
        max_detections_per_class: 20
        max_total_detections: 20
      }
#      score_converter: SOFTMAX
       score_converter: SIGMOID
    }
  }
}

train_config: {
#  fine_tune_checkpoint_version: V2
#  fine_tune_checkpoint: "../lynred_test_model_dir/ckpt-0"
#  fine_tune_checkpoint: "../models/ssd_mobilenet_v2_320x320_coco17_tpu-8/checkpoint/ckpt-0"
#  fine_tune_checkpoint_type: "classification"
  batch_size: 32
  sync_replicas: true
  startup_delay_steps: 0
  replicas_to_aggregate: 8
  num_steps: 500000
  data_augmentation_options {
    random_horizontal_flip {
      probability: 0.5
    }
  }
  data_augmentation_options {
    random_vertical_flip {
      probability: 0.5
    }
  }
  data_augmentation_options {
    random_rotation90 {
      keypoint_rot_permutation: 3
      keypoint_rot_permutation: 0
      keypoint_rot_permutation: 1
      keypoint_rot_permutation: 2
      probability: 0.5
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
      max_delta: 0.1
    }
  }
  data_augmentation_options {
    random_adjust_contrast {
      min_delta: 0.95
      max_delta: 1.05
    }
  }
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.01
	        decay_steps: 20000
	        decay_factor: 0.95
          #warmup_learning_rate: .001
          #warmup_steps: 1000
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  max_number_of_boxes: 20
  unpad_groundtruth_tensors: false
}

train_input_reader: {
  label_map_path: "./model_info/labelmap.pbtxt"
  tf_record_input_reader {
    input_path: "./ssd_data/train.record"
  }
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}

eval_input_reader: {
  label_map_path: "./model_info/labelmap.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "./ssd_data/val.record"
  }
}
